src/Documents/ПКО/ПКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПКО</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.Касса</registerRecords>
  <registerRecords>AccountingRegister.РегистрБухгалтерии</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.ПланСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Касса/Касса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Касса</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:AccumulationRegister>

src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccountingRegisters/РегистрБухгалтерии/РегистрБухгалтерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухгалтерии</name>
  <chartOfAccounts>ChartOfAccounts.ПланСчетов</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.ЮрЛица</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.ПланСчетов.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.ПланСчетов.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.ПланСчетов.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>ВалСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.ПланСчетов.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>УпрСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.ПланСчетов.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/ChartsOfAccounts/ПланСчетов/ПланСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>ПланСчетов</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>01.1</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.2</code>
      </childItems>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары</description>
        <code>01.5</code>
      </childItems>
      <childItems>
        <name>КассаВВалюте</name>
        <description>Касса в валюте</description>
        <code>01.11</code>
      </childItems>
    </items>
    <items>
      <name>Пассивы</name>
      <description>Пассивы</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Прибыль</name>
        <description>Прибыль</description>
        <code>02.1</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Взаиморасчеты</name>
      <description>Взаиморасчеты</description>
      <code>03</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>03.1</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>03.2</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

src/Documents/ПКО/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Взаиморасчеты.Записывать = Истина;
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Сумма;
	
	Движения.Касса.Записывать = Истина;
	Движение = Движения.Касса.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Сумма = Сумма;

///////////////БУХ УЧЕТ

Если Валюта.Пустая() Тогда
	Касса = ПланыСчетов.ПланСчетов.Касса;
	Курс = 1;
Иначе
	Касса = ПланыСчетов.ПланСчетов.КассаВВалюте;
	СрезПоследних = РегистрыСведений.КурсыВалют.СрезПоследних(Дата, Новый Структура("Валюта", Валюта));
	Курс = СрезПоследних[0].Курс; 
КонецЕсли; 

    Движения.РегистрБухгалтерии.Записывать = Истина;
	Проводка = Движения.РегистрБухгалтерии.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = Касса;
	Проводка.СчетКт = ПланыСчетов.ПланСчетов.Покупатели;
	Проводка.СубконтоКт.Контрагенты = Контрагент;
	
Если Касса.Валютный Тогда
	Проводка.ВалСуммаДт = Сумма;
	Проводка.ВалютаДт = Валюта;
КонецЕсли; 

Если КорСчет.Валютный Тогда
	Проводка.ВалСуммаКт = Сумма;
	Проводка.ВалютаКт = Валюта;	
КонецЕсли; 


	Проводка.Сумма = Сумма * Курс;
	
КонецПроцедуры
